app/Controllers/Home.php

    public function index()
    {
        if (!session()->get('login')) {
            return redirect()->to('/login')
                             ->with('error', 'Login terlebih dahulu!');
        }

        $memberModel = new MemberModel();
        $bukuModel = new BukuModel();
        $peminjamanModel = new PeminjamanModel();

        $total_members = $memberModel->countAllResults();
        $total_buku = $bukuModel->countAllResults();

        $peminjaman_list = $peminjamanModel->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `member`
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT *
FROM `peminjaman`