app/Controllers/Member.php

SELECT *
FROM `member`
ORDER BY `id_member` DESC
---
    public function index()
    {
        if (!session()->get('login')) {
            return redirect()->to('/login');
        }

        $memberModel = new MemberModel();

        $data['members'] = $memberModel
            ->orderBy('id_member', 'DESC')
            ->findAll();