app/Controllers/Peminjaman.php

    public function index()
    {
        if (!session()->get('login')) {
            return redirect()->to('/login');
        }

        $model = new PeminjamanModel();

        $data['peminjaman_list'] = $model
            ->select('peminjaman.*, member.nama as nama_member, buku.judul as judul_buku')
            ->join('member', 'member.id_member = peminjaman.id_member')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->orderBy('id_peminjaman', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.*, `member`.`nama` as `nama_member`, `buku`.`judul` as `judul_buku`
FROM `peminjaman`
JOIN `member` ON `member`.`id_member` = `peminjaman`.`id_member`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
ORDER BY `id_peminjaman` DESC